src/main/resources/META-INF/movilizer/wsdl/MovilizerOnlineV12Wsdl11.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!--
  ~ Copyright 2015 Movilizer GmbH
  ~
  ~ Licensed under the Apache License, Version 2.0 (the "License");
  ~ you may not use this file except in compliance with the License.
  ~ You may obtain a copy of the License at
  ~
  ~     http://www.apache.org/licenses/LICENSE-2.0
  ~
  ~ Unless required by applicable law or agreed to in writing, software
  ~ distributed under the License is distributed on an "AS IS" BASIS,
  ~ WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  ~ See the License for the specific language governing permissions and
  ~ limitations under the License.
  -->
<wsdl:definitions xmlns:tns="http://movilitas.com/movilizer/v12"
                  xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
                  xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
                  name="MovilizerOnlineV12Wsdl11"
                  targetNamespace="http://movilitas.com/movilizer/v12">
    <wsdl:types xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
        <xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema" targetNamespace="http://movilitas.com/movilizer/v12">
            <xsd:import namespace="http://movilitas.com/movilizer/v12" schemaLocation="MovilizerTypesV12.xsd"/>
        </xsd:schema>
    </wsdl:types>
    <wsdl:message xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" name="MovilizerOnlineResponse">
        <wsdl:part xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" element="tns:MovilizerOnlineResponse"
                   name="MovilizerOnlineResponse">
        </wsdl:part>
    </wsdl:message>
    <wsdl:message xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" name="MovilizerOnlineCallbackRequest">
        <wsdl:part xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" element="tns:MovilizerOnlineCallbackRequest"
                   name="MovilizerOnlineCallbackRequest">
        </wsdl:part>
    </wsdl:message>
    <wsdl:portType xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" name="MovilizerOnlineWebServiceV12">
        <wsdl:operation xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" name="MovilizerOnlineCallback">
            <wsdl:input xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" message="tns:MovilizerOnlineCallbackRequest"
                        name="MovilizerOnlineCallbackRequest"/>
            <wsdl:output xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" message="tns:MovilizerOnlineResponse"
                         name="MovilizerOnlineResponse"/>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" name="MovilizerOnlineWebServiceV12Soap11"
                  type="tns:MovilizerOnlineWebServiceV12">
        <soap:binding xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" style="document"
                      transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" name="MovilizerOnlineCallback">
            <soap:operation xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" soapAction=""/>
            <wsdl:input xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" name="MovilizerOnlineCallbackRequest">
                <soap:body xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" use="literal"/>
            </wsdl:input>
            <wsdl:output xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" name="MovilizerOnlineResponse">
                <soap:body xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" name="MovilizerOnlineWebServiceV12Service">
        <wsdl:port xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" binding="tns:MovilizerOnlineWebServiceV12Soap11"
                   name="MovilizerOnlineWebServiceV12Soap11">
            <soap:address xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
                          location="http://example.com/services/myMovlizerOnlineSyncService"/>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>
